Белгипрозем_2017/src/Documents/УчетДоговоров/УчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетДоговоров</name>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДоговор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчастков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смета</name>
    <type>
      <types>CatalogRef.мСметы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Белгипрозем_2017/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредпринимательНеРезидент</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/УчетДоговоров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрыватьДокумент = Истина;
	
	// Расчет стоимости
	Стоимость = Объект.Сумма - Объект.НДС;
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Если Параметры.Свойство("Действие") Тогда
			// документ открывается из этапа
			Действие = Параметры.Действие;
			ДатаПоследнейЗаписи = НачалоДня(Параметры.Дата);
			Объект.Дата = ДатаПоследнейЗаписи;
			ОткрыватьДокумент = Параметры.ОткрыватьДокумент;
			Если Не ОткрыватьДокумент Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			КонецЕсли; 
			Оповещать = Параметры.Оповещать;
			
			Параметры.Свойство("НеИзменятьЭтап", НеИзменятьЭтап);
			
			Если Действие = "Изменить" Тогда
				//Если документ не должен открываться - надо его заполнить из параметров
				Если Не ОткрыватьДокумент Тогда
					ЗаполнитьЗначенияСвойств(Объект, Параметры);
					Объект.Корреспондент = Объект.Договор.Корреспондент;
					Объект.Организация = Объект.Договор.Организация;
					Стоимость = Параметры.Стоимость;
				КонецЕсли; 
				
			ИначеЕсли Действие = "Добавить новую" Тогда	
				// заполняем новый док из параметров
				ЗаполнитьЗначенияСвойств(Объект, Параметры);
				Объект.Корреспондент = Объект.Договор.Корреспондент;
				Объект.Организация = Объект.Договор.Организация;
				Стоимость = Параметры.Стоимость;
				//Объект.Дата = НачалоДня(ТекущаяДата());
				
			КонецЕсли; 
		КонецЕсли; 
		Результат = мРаботаСДоговорами.ПолучитьПоследнийУчетДоговоров(Объект.Ссылка, Объект.ЭтапДоговора, Объект.Дата);
		Результат.Свойство("ПоследнийВПоследовательности", ПоследнийВПоследовательности);
		Результат.Свойство("ДатаПоследнегоДокумента", ДатаПоследнегоДокумента);
	Иначе
		// Документ открывается сам по себе
		// Если не новый и не последний в последовательности - только просмотр
		Если Не Объект.Ссылка.Пустая() Тогда
			//// Расчет стоимости
			//Стоимость = Объект.Сумма - Объект.НДС;
			Результат = мРаботаСДоговорами.ПолучитьПоследнийУчетДоговоров(Объект.Ссылка, Объект.ЭтапДоговора, Объект.Дата);
			Результат.Свойство("ПоследнийВПоследовательности", ПоследнийВПоследовательности);
			Результат.Свойство("ДатаПоследнегоДокумента", ДатаПоследнегоДокумента);
			
			Если Не ПоследнийВПоследовательности Тогда
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();	
		Объект.Дата = НачалоДня(Объект.Дата); 
	КонецЕсли; 
	
	//ПолучитьПараметрыСтавкиНДС(Объект.СтавкаНДС);
	РеквНДС = ПолучитьРеквизитыСтавкиНДС(Объект.СтавкаНДС);
	ЗначениеСтавкиНДС = РеквНДС.ЗначениеСтавкиНДС;
	БезНДС = РеквНДС.БезНДС;
	
	УстановитьВидКорреспондента();
	
	
	ТекущаяДатаДокумента = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапДоговораПриИзменении(Элемент)
	ЗаполнитьРеквизитыИзЭтапа(Объект.ЭтапДоговора);
    
    Если Не ЗначениеЗаполнено(Объект.ОснованиеЭтапДоговора) Тогда
        Объект.ОснованиеЭтапДоговора = Объект.ЭтапДоговора;
    КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыИзЭтапа(ЭтапДоговора)
	Подразделение = ЭтапДоговора.Подразделение;
	Сумма = ЭтапДоговора.СтоимостьСНДС;
	НДС = ЭтапДоговора.СуммаНДС;
	Организация = ЭтапДоговора.Владелец.Организация;
КонецПроцедуры // ЗаполнитьРеквизитыИзЭтапа()

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(Объект.ОснованиеДоговор) Тогда
        Объект.ОснованиеДоговор = Объект.Договор;
	КонецЕсли; 
	УстановитьВидКорреспондента();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидКорреспондента()
	Корреспондент = Объект.Договор.Корреспондент;
	Объект.Корреспондент = Объект.Договор.Корреспондент;
	ЭтоФизЛицо = Ложь;
	
    Если ЗначениеЗаполнено(Корреспондент) Тогда
		Если Корреспондент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ЭтоФизЛицо = Истина;
        КонецЕсли; 
	КонецЕсли; 
	ВидимостьРеквизитов();
КонецПроцедуры // УстановитьВидКорреспондента()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыДока = Новый Структура();
		ПараметрыДока.Вставить("ЭтапДоговора", Объект.ЭтапДоговора);
		ПараметрыДока.Вставить("КоличествоУчастков", Объект.КоличествоУчастков);
		ПараметрыДока.Вставить("Цена", Объект.Цена);
		ПараметрыДока.Вставить("ДатаПоследнейЗаписи", Объект.Дата);
		ПараметрыДока.Вставить("СтавкаНДС", Объект.СтавкаНДС);
		ПараметрыДока.Вставить("ОсвобождениеОтНДС", Объект.ОсвобождениеОтНДС);
		ПараметрыДока.Вставить("Стоимость", Стоимость);
		ПараметрыДока.Вставить("СуммаНДС", Объект.НДС);
		ПараметрыДока.Вставить("СтоимостьСНДС", Объект.Сумма);
		//ПараметрыДока.Вставить("Режим", "Вручную");
		//Если Оповещать Тогда
			Оповестить("Записан Учет договоров", ПараметрыДока, Объект.Ссылка);
            //ОповеститьОбИзменении(Объект.ЭтапДоговора); 
		//КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьРеквизитов()
	
	Элементы.ДляДоговораФизЛиц.Видимость = ЭтоФизЛицо;
	Элементы.ОсвобождениеОтНДС.Видимость = БезНДС;
	Если Не БезНДС Тогда
		Объект.ОсвобождениеОтНДС = "";
	КонецЕсли; 
	
КонецПроцедуры // ВидимостьРеквизитов()

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	РассчитатьСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУчастковПриИзменении(Элемент)
	РассчитатьСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимость()
	Если ЭтоФизЛицо Тогда
		Объект.КоличествоУчастков = ?(Объект.КоличествоУчастков = 0, 1, Объект.КоличествоУчастков);
		Стоимость = Объект.Цена * Объект.КоличествоУчастков;
	КонецЕсли; 
	
	РассчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ПолучитьПараметрыСтавкиНДС(Объект.СтавкаНДС);
	ВидимостьРеквизитов();    
	РассчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыСтавкиНДС(СтавкаНДС)
	РеквНДС = ПолучитьРеквизитыСтавкиНДС(СтавкаНДС);
	ЗначениеСтавкиНДС = РеквНДС.ЗначениеСтавкиНДС;
	БезНДС = РеквНДС.БезНДС;
КонецПроцедуры // 

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыСтавкиНДС(СтавкаНДС)
	РеквНДС = Новый Структура("ЗначениеСтавкиНДС, БезНДС", Неопределено, Неопределено); 
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		РеквНДС.Вставить("ЗначениеСтавкиНДС", СтавкаНДС.Ставка);
		РеквНДС.Вставить("БезНДС", СтавкаНДС.НеОблагается);
	КонецЕсли;
	Возврат РеквНДС;
КонецФункции // 

&НаКлиенте
Процедура РассчитатьНДС()
    Объект.НДС = Окр(Стоимость * ЗначениеСтавкиНДС / 100, ЗнакОкр(Объект.Дата));
	РассчитатьСтоимостьСНДС();
КонецПроцедуры // РассчитатьНДС()

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент)
	Модифицированность = Истина;
    РассчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура НДСПриИзменении(Элемент)
	РассчитатьСтоимостьСНДС();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьСНДС()
    Объект.Сумма = Стоимость + Объект.НДС;
КонецПроцедуры // РассчитатьСтоимостьСНДС()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = НачалоДня(Объект.Дата);	
	Если НачалоДня(Объект.Дата) <= НачалоДня(ДатаПоследнегоДокумента)  Тогда
		Объект.Дата = НачалоДня(ТекущаяДатаДокумента);
		Сообщить("Нельзя вводить дату ранее или равной " + Формат(ДатаПоследнегоДокумента, "ДФ=dd.MM.yyyy"));
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДиалогом()
	ЭтаФорма.Доступность = ПоследнийВПоследовательности;	
	ЭтаФорма.ТолькоПросмотр = Не ПоследнийВПоследовательности;
КонецПроцедуры // УправлениеДиалогом()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ОткрыватьДокумент Тогда
		// Документ заполнен из параметорв - записать и провести 
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	//Если НеИзменятьЭтап Тогда
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("НеИзменятьЭтап", НеИзменятьЭтап);
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НеИзменятьЭтап Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеИзменятьЭтап", НеИзменятьЭтап);
	КонецЕсли; 
	Если Оповещать Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеИзменятьДоговор", Истина);
	КонецЕсли; 
	ТекущийОбъект.Дата = НачалоДня(ТекущийОбъект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ОткрыватьДокумент Тогда
		// Документ заполнен из параметорв - записать и провести 
		Отказ = Истина;
		СтруктураЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение); 
		Записать(СтруктураЗаписи);
		Возврат;
	КонецЕсли; 
	ВидимостьРеквизитов();
	УправлениеДиалогом();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗнакОкр(Дата) Экспорт
	Если Дата < Дата(2016, 7, 1) Тогда
		Возврат 0;
	Иначе	
	    Возврат 2;
	КонецЕсли; 
КонецФункции // ЗнакОкр()
